Информационная_база/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскаяПлата</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Documents/ЗаказПокупателя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
		
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");    
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//ИЗМЕНЕНО  Степанов ЮЛ (Начало 11.03.2025)
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора");
  
   Если Не ЗначениеЗаполнено(ДанныеДоговора.ВКМ_ДатаНачалаДействияДоговора) Или Не ЗначениеЗаполнено(ДанныеДоговора.ВКМ_ДатаОкончанияДействияДоговора) Тогда
   	ТекстСообщения = "В выбранном договоре не установлен период действия";	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект", Отказ);	
	Возврат;
   ИначеЕсли
     Дата(ДанныеДоговора.ВКМ_ДатаНачалаДействияДоговора) > Дата(Дата) 
     ИЛИ  Дата(Дата) > Дата(ДанныеДоговора.ВКМ_ДатаОкончанияДействияДоговора) Тогда 
	ТекстСообщения = "В выбранный период договор недейстителен!";
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект", Отказ);	
	Возврат;	
   КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбработкаЗаказовОбороты.Контрагент КАК Контрагент,
		|	ОбработкаЗаказовОбороты.Договор КАК Договор,
		|	ОбработкаЗаказовОбороты.Заказ КАК Заказ,
		|	ОбработкаЗаказовОбороты.СуммаЗаказаОборот КАК СуммаЗаказаОборот,
		|	ОбработкаЗаказовОбороты.СуммаОплатыОборот КАК СуммаОплатыОборот,
		|	ОбработкаЗаказовОбороты.СуммаОтгрузкиОборот КАК СуммаОтгрузкиОборот
		|ИЗ
		|	РегистрНакопления.ОбработкаЗаказов.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ОбработкаЗаказовОбороты
		|ГДЕ
		|	ОбработкаЗаказовОбороты.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда	
		ТекстСообщения = "По данному договору Заказ поставщика в этом месяце был осуществлен!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект",);			
	КонецЕсли;
   
	//КОНЕЦ Изменений

    
	Движения.ЗадолженностьПокупателей.Записывать = Истина;
	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Движение = Движения.ЗадолженностьПокупателей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Заказ = Ссылка;
	Движение.Договор = Договор;
	Движение.СуммаЗаказа = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;

	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

//ИЗМЕНЕНО  Степанов ЮЛ (Начало 26.02.2025)
Процедура ВыполнитьАвтозаполнение() Экспорт
	
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_АбонентскаяПлата");

	Если ДанныеДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскаяПлата Тогда 
		
		ТекстСообщения = "Необходимо выбрать договор абонентского обслуживания, чтобы воспользоваться командой - заполнить";
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,"Договор","Объект");	
		
		Возврат;
		
	Иначе
		
		НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатруаРаботыСпециалиста.Получить();
		
		Услуги.Очистить();
		
		   Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
               ТекстСообщения = "Установите номенклатуру - Абонентская плата в константе";
	           ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	           Возврат;
		   КонецЕсли;
		
		   Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
               ТекстСообщения = "Установите номенклатуру работы специалиста в константе";
	           ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	           Возврат;
		   КонецЕсли;
		   
		 Если ЗначениеЗаполнено(ДанныеДоговора.ВКМ_АбонентскаяПлата) Тогда
            НоваяСтрока = Услуги.Добавить(); 
            НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
            НоваяСтрока.Сумма = ДанныеДоговора.ВКМ_АбонентскаяПлата;
		 КонецЕсли;
		 
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст =
		 	"ВЫБРАТЬ
		 	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплатеОборот,
		 	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовОборот, 0) КАК КоличествоЧасовОборот
		 	|ИЗ
		 	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты(&НачалоПериод, &КонецПериода, , , ) КАК ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты
		 	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		 	|		ПО ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор = ЗаказПокупателя.Договор
		 	|			И ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Клиент = ЗаказПокупателя.Контрагент
		 	|ГДЕ
		 	|	ЗаказПокупателя.Ссылка = &Ссылка";
		 
		 Запрос.УстановитьПараметр("Ссылка", Ссылка);
		 Запрос.УстановитьПараметр("НачалоПериод", НачалоМесяца(Дата));
		 Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		 
		// Если  РезультатЗапроса.Пустой() Тогда
		     //Возврат;
	     //КонецЕсли;
		 
		 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            НоваяСтрока = Услуги.Добавить(); 
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасовОборот;
            НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплатеОборот;
		 КонецЦикла;
		СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	 

	КонецЕсли;
		
	
КонецПроцедуры  
#КонецОбласти  
//КОНЕЦ Изменений


#КонецЕсли
